OpFile/AirTemcoupling/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Currently optional dependency for pimpleFoam
libs            (interfaceTrackingFvMesh);

application     chtMultiRegionFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.0005;

// enable adaptive timestep (based on Courant number) for safer larger steps
adjustTimeStep   yes;
maxCo            0.5;
maxDeltaT        0.0005;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    pointHistory
    {
        type pointHistory;
        refHistoryPoint (0.00102 0 0);
        fileName rightPoint.txt;
    }
}


// ************************************************************************* //
