OpFile/AirTemcoupling/0/airRegion/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 7.12e-9;

boundaryField
{
    inLetAir
    {
        type zeroGradient;
    }
    outLetAir
    {
        type            zeroGradient;
    }
    yFrontCyclic
    {
        type            cyclic;
    }
    yBackCyclic
    {
        type            cyclic;
    }
    groundWall
    {
        type            epsilonWallFunction;
        value           uniform 7.12e-9;
        inletValue      uniform 7.12e-9; 
    }
    topWall
    {
        type            zeroGradient;
    }
    airRegion_to_panel
    {
        type            epsilonWallFunction;
        value           uniform 7.12e-9;
        inletValue      uniform 7.12e-9; 
    }
}

// ************************************************************************* //
