OpFile/AirTemcoupling/system/panel/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system/panel";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     steadyState;
}

gradSchemes
{
    default     Gauss linear;
}

divSchemes
{
    default     none;
    div(phi,h)  Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear corrected;
    laplacian(alphaEff,h) Gauss linear corrected;  // 热传导核心格式
}

interpolationSchemes
{
    default     linear;
}

snGradSchemes
{
    default     corrected;
}

// ************************************************************************* //
